-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\copd_log_psm\02_cr_cr
> eate_copd_exposure.log
  log type:  text
 opened on:  19 Aug 2020, 10:08:18

. 
. /* TREATMENT EXPOSURE========================================================
> =*/        
. 
. /* LABA LAMA */ 
. 
. * At least one prescription in LABA-LAMA combination list 
. gen exptemp1 = 1 if laba_lama == 1 
(245,913 missing values generated)

. * OR at least one prescription of LABA AND at least one prescription of LAMA
. gen exptemp2 = 1 if laba_single == 1 & lama_single == 1 
(289,671 missing values generated)

. 
. gen exposure = 0 if             exptemp1 == 1 | ///
>                                                 exptemp2 == 1
(243,664 missing values generated)

.                                                 
. * AND no prescription for an ICS 
. recode exposure(0 = .u) if ics_single == 1 
(exposure: 1493 changes made)

. recode exposure(0 = .u) if laba_ics == 1 
(exposure: 1905 changes made)

. recode exposure(0 = .u) if laba_lama_ics == 1 
(exposure: 1727 changes made)

. 
. /* ICS */
.                                 
. * Any prescription for a LABA LAMA ICS combination 
. gen exptemp3 = 1 if laba_lama_ics == 1
(259,057 missing values generated)

. * OR Any prescription for a LABA ICS combination product 
. gen exptemp4 = 1 if laba_ics == 1 
(216,545 missing values generated)

. * OR Any prescription for single ICS + Single LABA
. gen exptemp5 = 1 if ics_single == 1 & laba_single == 1 
(291,643 missing values generated)

. * OR Any prescription for single ICS + LABA/LAMA
. gen exptemp6 = 1 if ics_single == 1 & laba_lama == 1
(290,764 missing values generated)

.                                         
. replace exposure = 1 if exptemp3 == 1 | /// 
>                                                 exptemp4 == 1 | /// 
>                                                 exptemp5 == 1 | ///
>                                                 exptemp6 == 1 
(105,249 real changes made)

.                                                 
. 
. replace exposure = .u if exposure >= .
(143,540 real changes made, 143,540 to missing)

.                                                 
. label define exposure 0 "LABA/LAMA Combination" 1 "ICS Combination" .u "Other
> "

. label values exposure exposure 

. 
. label var exposure "COPD Treatment Exposure"

. 
. * Drop temporary variables 
. drop exptemp*

. 
. /* SAVE DATA=================================================================
> =*/        
. 
. sort patient_id

. save $tempdir\analysis_dataset, replace
file copd_tempdata_psm\analysis_dataset.dta saved

. 
. * Save a version set on CPNS survival outcome
. stset stime_$outcome, fail($outcome) id(patient_id) enter(enter_date) origin(
> enter_date)        

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    292,097  total observations
          0  exclusions
------------------------------------------------------------------------------
    292,097  observations remaining, representing
    292,097  subjects
        742  failures in single-failure-per-subject data
   19184453  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        66

. save $tempdir\analysis_dataset_STSET_$outcome, replace
file copd_tempdata_psm\analysis_dataset_STSET_onscoviddeath.dta saved

. 
end of do-file

. do "02b_cr_derive_ps_copd.do"

. /*===========================================================================
> ===
> DO FILE NAME:                   02b_cr_derive_ps_copd
> PROJECT:                                ICS in COVID-19 
> DATE:                                   11th of August 2020
> AUTHOR:                                 A Schultze 
> VERSION:                                Stata 16.1                           
>                                            
> DESCRIPTION OF FILE:    program 02b 
>                                                 derive PS 
>                                                 check overlap and distributio
> n 
>                                                 create weights for the popula
> tion 
> DATASETS USED:                  data in memory 
> DATASETS CREATED:               analysis_dataset_STSET_IPW_$outcome.dta
> OTHER OUTPUT:                   logfiles, printed to folder analysis/$logdir
>                                                         
> =============================================================================
> =*/
. 
. * Open a log file
. 
. cap log close
