------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\flow_chart_numbers.log
  log type:  text
 opened on:  11 Jun 2020, 10:04:46

. import delimited input_copd_flow_chart.csv, clear
(9 vars, 33,278,642 obs)

. 
. /*
> # COPD pop
> copd AND
> (age >=35 AND age <= 110) AND
> ever_smoked AND
> has_follow_up AND NOT
> recent_asthma AND NOT
> other_respiratory AND NOT
> nebules AND NOT
> ltra_single
> */
. count
  33,278,642

. drop if has_follow_up!=1
(11,628,965 observations deleted)

. count
  21,649,677

. drop if copd!=1
(21,075,251 observations deleted)

. count
  574,426

. drop if age_cat!=1
(6,423 observations deleted)

. count
  568,003

. drop if ever_smoked!=1
(51,330 observations deleted)

. count
  516,673

. drop if recent_asthma==1
(146,643 observations deleted)

. count
  370,030

. drop if other_respiratory==1
(65,217 observations deleted)

. count
  304,813

. drop if nebules==1
(9,738 observations deleted)

. count
  295,075

. drop if ltra_single==1
(1,959 observations deleted)

. count
  293,116

. 
. 
. import delimited input_asthma_flow_chart.csv, clear
(27 vars, 33,278,642 obs)

. 
. /*
> # Main asthma pop
> has_asthma AND
> (age >=18 AND age <= 110) AND
> has_follow_up AND NOT
> copd AND NOT
> other_respiratory AND NOT
> nebules AND NOT
> (
>   (lama_single OR laba_lama) AND NOT (
>     high_dose_ics OR
>     high_dose_ics_single_ing OR
>     high_dose_ics_multiple_ingredient OR
>     low_med_dose_ics_single_ingredient OR
>     low_med_dose_ics_multiple_ingredient OR
>     low_med_dose_ics OR
>     ics_single OR
>     laba_ics OR
>     laba_lama_ics
>   )
> )
> */
. preserve

. count
  33,278,642

. drop if has_follow_up!=1
(11,628,965 observations deleted)

. count
  21,649,677

. drop if has_asthma!=1
(19,860,488 observations deleted)

. count
  1,789,189

. drop if age_cat!=1
(601,504 observations deleted)

. count
  1,187,685

. drop if copd==1
(171,684 observations deleted)

. count
  1,016,001

. drop if other_respiratory==1
(25,943 observations deleted)

. count
  990,058

. drop if nebules==1
(7,728 observations deleted)

. count
  982,330

. drop if lama_no_ics==1
(1,493 observations deleted)

. count
  980,837

. restore

. /*
> # Sensitivity analysis population
> (
>   has_asthma OR
>   (asthma_ever AND any_asthma_med)
> ) AND
> (age >=18 AND age <= 110) AND
> has_follow_up AND NOT
> copd AND NOT
> other_respiratory AND NOT
> nebules AND NOT
> (
>   (lama_single OR laba_lama) AND NOT (
>     high_dose_ics OR
>     high_dose_ics_single_ing OR
>     high_dose_ics_multiple_ingredient OR
>     low_med_dose_ics_single_ingredient OR
>     low_med_dose_ics_multiple_ingredient OR
>     low_med_dose_ics OR
>     ics_single OR
>     laba_ics OR
>     laba_lama_ics
>   )
> )
> */
. preserve

. count
  33,278,642

. drop if has_follow_up!=1
(11,628,965 observations deleted)

. count
  21,649,677

. drop if asthma_sensitivity!=1
(19,736,294 observations deleted)

. count
  1,913,383

. drop if age_cat!=1
(618,679 observations deleted)

. count
  1,294,704

. drop if copd==1
(241,217 observations deleted)

. count
  1,053,487

. drop if other_respiratory==1
(27,928 observations deleted)

. count
  1,025,559

. drop if nebules==1
(7,912 observations deleted)

. count
  1,017,647

. drop if lama_no_ics==1
(1,835 observations deleted)

. count
  1,015,812

. restore

. 
. 
. log close
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\flow_chart_numbers.log
  log type:  text
 closed on:  11 Jun 2020, 10:08:37
------------------------------------------------------------------------------------------------------------------------------------------------
