----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis/flow_chart_numbers.log
  log type:  text
 opened on:  24 Jul 2020, 09:49:55

. cd `c(pwd)'/output/
E:\analyses\opensafely-ics-research\output

. import delimited input_copd_flow_chart.csv, clear
(9 vars, 33,356,521 obs)

. 
. /*
> # COPD pop
> copd AND
> (age >=35 AND age <= 110) AND
> ever_smoked AND
> has_follow_up AND NOT
> recent_asthma AND NOT
> other_respiratory AND NOT
> nebules AND NOT
> ltra_single
> */
. count
  33,356,521

. drop if has_follow_up!=1
(11,695,479 observations deleted)

. count
  21,661,042

. drop if copd!=1
(21,085,975 observations deleted)

. count
  575,067

. drop if age_cat!=1
(6,424 observations deleted)

. count
  568,643

. drop if ever_smoked!=1
(51,399 observations deleted)

. count
  517,244

. drop if recent_asthma==1
(146,891 observations deleted)

. count
  370,353

. drop if other_respiratory==1
(65,279 observations deleted)

. count
  305,074

. drop if nebules==1
(9,743 observations deleted)

. count
  295,331

. drop if ltra_single==1
(1,955 observations deleted)

. count
  293,376

. 
. 
. import delimited input_asthma_flow_chart.csv, clear
(27 vars, 33,356,521 obs)

. 
. /*
> # Main asthma pop
> has_asthma AND
> (age >=18 AND age <= 110) AND
> has_follow_up AND NOT
> copd AND NOT
> other_respiratory AND NOT
> nebules AND NOT
> (
>   (lama_single OR laba_lama) AND NOT (
>     high_dose_ics OR
>     high_dose_ics_single_ing OR
>     high_dose_ics_multiple_ingredient OR
>     low_med_dose_ics_single_ingredient OR
>     low_med_dose_ics_multiple_ingredient OR
>     low_med_dose_ics OR
>     ics_single OR
>     laba_ics OR
>     laba_lama_ics
>   )
> )
> */
. preserve

. count
  33,356,521

. drop if has_follow_up!=1
(11,695,479 observations deleted)

. count
  21,661,042

. drop if has_asthma!=1
(19,870,502 observations deleted)

. count
  1,790,540

. drop if age_cat!=1
(279,195 observations deleted)

. count
  1,511,345

. drop if copd==1
(174,359 observations deleted)

. count
  1,336,986

. drop if other_respiratory==1
(28,087 observations deleted)

. count
  1,308,899

. drop if nebules==1
(8,797 observations deleted)

. count
  1,300,102

. drop if lama_no_ics==1
(1,573 observations deleted)

. count
  1,298,529

. restore

. /*
> # Sensitivity analysis population
> (
>   has_asthma OR
>   (asthma_ever AND any_asthma_med)
> ) AND
> (age >=18 AND age <= 110) AND
> has_follow_up AND NOT
> copd AND NOT
> other_respiratory AND NOT
> nebules AND NOT
> (
>   (lama_single OR laba_lama) AND NOT (
>     high_dose_ics OR
>     high_dose_ics_single_ing OR
>     high_dose_ics_multiple_ingredient OR
>     low_med_dose_ics_single_ingredient OR
>     low_med_dose_ics_multiple_ingredient OR
>     low_med_dose_ics OR
>     ics_single OR
>     laba_ics OR
>     laba_lama_ics
>   )
> )
> */
. preserve

. count
  33,356,521

. drop if has_follow_up!=1
(11,695,479 observations deleted)

. count
  21,661,042

. drop if asthma_sensitivity!=1
(19,746,105 observations deleted)

. count
  1,914,937

. drop if age_cat!=1
(284,992 observations deleted)

. count
  1,629,945

. drop if copd==1
(244,024 observations deleted)

. count
  1,385,921

. drop if other_respiratory==1
(30,284 observations deleted)

. count
  1,355,637

. drop if nebules==1
(9,008 observations deleted)

. count
  1,346,629

. drop if lama_no_ics==1
(1,912 observations deleted)

. count
  1,344,717

. restore

. 
. 
. log close
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis/flow_chart_numbers.log
  log type:  text
 closed on:  24 Jul 2020, 09:53:49
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
