----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\qba_log\gr_e-value_plot.log
  log type:  text
 opened on:  24 Jul 2020, 11:32:16

. 
. ****************************
. /* Input effect estimates */
. ****************************
. clear

. use copd_tempdata/temp_copd.dta

. 
. * COPD
. glob hr_copd = estimate

. glob lci_copd = min95

. glob uci_copd = max95

. 
. clear 

. use asthma_tempdata/temp_asthma.dta

. 
. * Asthma low-dose ICS
. glob hr_asthma_ld = estimate

. glob lci_asthma_ld = min95

. glob uci_asthma_ld = max95

. 
. * Asthma high-dose ICS
. glob hr_asthma_hd = estimate

. glob lci_asthma_hd = min95

. glob uci_asthma_hd = max95

. 
. **************************
. /* Create e-value plots */
. **************************
. 
. * COPD 
. evalue hr $hr_copd, lcl($lci_copd) ucl($uci_copd) true(1.0) figure(scheme("s1color") aspect(1.01) ytitle(,size(small) margin(medium)) xtitle(,size(small) margin(medium)))
   E-value (point estimate): 2.430
   E-value (CI): 1.738

. * addplot: 
. graph save "$outdir/evalue_COPD.gph", replace
(note: file qba_out/evalue_COPD.gph not found)
(file qba_out/evalue_COPD.gph saved)

. graph export "$outdir/evalue_COPD.svg", replace 
(note: file qba_out/evalue_COPD.svg not found)
(file qba_out/evalue_COPD.svg written in SVG format)

. 
. evalue hr $hr_copd, lcl($lci_copd) ucl($uci_copd) true(0.8) figure(scheme("s1color") aspect(1.01) ytitle(,size(small) margin(medium)) xtitle(,size(small) margin(medium)))
   E-value (point estimate): 3.234
   E-value (CI): 2.420

. * addplot: 
. graph save "$outdir/evalue_protect_COPD.gph", replace
(note: file qba_out/evalue_protect_COPD.gph not found)
(file qba_out/evalue_protect_COPD.gph saved)

. graph export "$outdir/evalue_protect_COPD.svg", replace 
(note: file qba_out/evalue_protect_COPD.svg not found)
(file qba_out/evalue_protect_COPD.svg written in SVG format)

. 
. * Ashtma low-dose ICS
. evalue hr $hr_asthma_ld, lcl($lci_asthma_ld) ucl($uci_asthma_ld) true(1.0) figure(scheme("s1color") aspect(1.01) ytitle(,size(small) margin(medium)) xtitle(,size(small) m
> argin(medium))) 
   E-value (point estimate): 2.060
   E-value (CI): 1.110

. graph save "$outdir/evalue_Asthma_LD.gph", replace
(note: file qba_out/evalue_Asthma_LD.gph not found)
(file qba_out/evalue_Asthma_LD.gph saved)

. graph export "$outdir/evalue_Asthma_LD.svg", replace 
(note: file qba_out/evalue_Asthma_LD.svg not found)
(file qba_out/evalue_Asthma_LD.svg written in SVG format)

. 
. evalue hr $hr_asthma_ld, lcl($lci_asthma_ld) ucl($uci_asthma_ld) true(0.8) figure(scheme("s1color") aspect(1.01) ytitle(,size(small) margin(medium)) xtitle(,size(small) m
> argin(medium))) 
   E-value (point estimate): 2.791
   E-value (CI): 1.838

. graph save "$outdir/evalue_protect_Asthma_LD.gph", replace
(note: file qba_out/evalue_protect_Asthma_LD.gph not found)
(file qba_out/evalue_protect_Asthma_LD.gph saved)

. graph export "$outdir/evalue_protect_Asthma_LD.svg", replace 
(note: file qba_out/evalue_protect_Asthma_LD.svg not found)
(file qba_out/evalue_protect_Asthma_LD.svg written in SVG format)

. 
. * Asthma high-dose ICS
. evalue hr $hr_asthma_hd, lcl($lci_asthma_hd) ucl($uci_asthma_hd) true(1.0) figure(scheme("s1color") aspect(1.01) ytitle(,size(small) margin(medium)) xtitle(,size(small) m
> argin(medium)))
   E-value (point estimate): 2.060
   E-value (CI): 1.110

. graph save "$outdir/evalue_Asthma_HD.gph", replace 
(note: file qba_out/evalue_Asthma_HD.gph not found)
(file qba_out/evalue_Asthma_HD.gph saved)

. graph export "$outdir/evalue_Asthma_HD.svg", replace 
(note: file qba_out/evalue_Asthma_HD.svg not found)
(file qba_out/evalue_Asthma_HD.svg written in SVG format)

. 
. evalue hr $hr_asthma_hd, lcl($lci_asthma_hd) ucl($uci_asthma_hd) true(0.8) figure(scheme("s1color") aspect(1.01) ytitle(,size(small) margin(medium)) xtitle(,size(small) m
> argin(medium)))
   E-value (point estimate): 2.791
   E-value (CI): 1.838

. graph save "$outdir/evalue_protect_Asthma_HD.gph", replace 
(note: file qba_out/evalue_protect_Asthma_HD.gph not found)
(file qba_out/evalue_protect_Asthma_HD.gph saved)

. graph export "$outdir/evalue_protect_Asthma_HD.svg", replace 
(note: file qba_out/evalue_protect_Asthma_HD.svg not found)
(file qba_out/evalue_protect_Asthma_HD.svg written in SVG format)

. 
. *close log
. log close 
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\qba_log\gr_e-value_plot.log
  log type:  text
 closed on:  24 Jul 2020, 11:32:26
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
