--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\copd_log\02_cr_create_copd_exposure.log
  log type:  text
 opened on:  18 May 2020, 09:50:15

. 
. /* TREATMENT EXPOSURE=========================================================*/        
. 
. /* LABA LAMA */ 
. 
. * At least one prescription in LABA-LAMA combination list 
. gen exptemp1 = 1 if laba_lama == 1 
(271,751 missing values generated)

. * OR at least one prescription of LABA AND at least one prescription of LAMA
. gen exptemp2 = 1 if laba_single == 1 & lama_single == 1 
(318,666 missing values generated)

. 
. gen exposure = 0 if             exptemp1 == 1 | ///
>                                                 exptemp2 == 1
(269,265 missing values generated)

.                                                 
. * AND no prescription for an ICS 
. recode exposure(0 = .u) if ics_single == 1 
(exposure: 1661 changes made)

. recode exposure(0 = .u) if laba_ics == 1 
(exposure: 2101 changes made)

. recode exposure(0 = .u) if laba_lama_ics == 1 
(exposure: 1837 changes made)

. 
. /* ICS */
.                                 
. * Any prescription for a LABA LAMA ICS combination 
. gen exptemp3 = 1 if laba_lama_ics == 1
(284,114 missing values generated)

. * OR Any prescription for a LABA ICS combination product 
. gen exptemp4 = 1 if laba_ics == 1 
(235,387 missing values generated)

. * OR Any prescription for single ICS + Single LABA
. gen exptemp5 = 1 if ics_single == 1 & laba_single == 1 
(320,795 missing values generated)

. * OR Any prescription for single ICS + LABA/LAMA
. gen exptemp6 = 1 if ics_single == 1 & laba_lama == 1
(319,869 missing values generated)

.                                         
. replace exposure = 1 if exptemp3 == 1 | /// 
>                                                 exptemp4 == 1 | /// 
>                                                 exptemp5 == 1 | ///
>                                                 exptemp6 == 1 
(119,363 real changes made)

.                                                 
. 
. replace exposure = .u if exposure >= .
(155,501 real changes made, 155,501 to missing)

.                                                 
. label define exposure 0 "LABA/LAMA Combination" 1 "ICS Combination" .u "Other"

. label values exposure exposure 

. 
. label var exposure "COPD Treatment Exposure"

. 
. * Drop temporary variables 
. drop exptemp*

. 
. /* SAVE DATA==================================================================*/        
. 
. sort patient_id

. save $tempdir\analysis_dataset, replace
file copd_tempdata\analysis_dataset.dta saved

. 
. * Save a version set on CPNS survival outcome
. stset stime_cpnsdeath, fail(cpnsdeath) id(patient_id) enter(enter_date) origin(enter_date)      

                id:  patient_id
     failure event:  cpnsdeath != 0 & cpnsdeath < .
obs. time interval:  (stime_cpnsdeath[_n-1], stime_cpnsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    321,339  total observations
         47  observations end on or before enter()
------------------------------------------------------------------------------
    321,292  observations remaining, representing
    321,292  subjects
        509  failures in single-failure-per-subject data
   17598874  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        55

. save $tempdir\analysis_dataset_STSET_cpnsdeath, replace
file copd_tempdata\analysis_dataset_STSET_cpnsdeath.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\copd_log\02_cr_create_copd_exposure.log
  log type:  text
 closed on:  18 May 2020, 09:50:20
--------------------------------------------------------------------------------------------------------
