-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\asthma_log_psm\02b_cr
> _derive_ps_asthma.log
  log type:  text
 opened on:  19 Aug 2020, 18:48:20

. 
. /* PS Model==================================================================
> =*/
. 
. mlogit exposure i.male age1 age2 age3 $varlist, base(0)

Iteration 0:   log likelihood = -610663.65  
Iteration 1:   log likelihood = -590822.79  
Iteration 2:   log likelihood = -589813.18  
Iteration 3:   log likelihood = -589812.06  
Iteration 4:   log likelihood = -589812.06  

Multinomial logistic regression                 Number of obs     =    818,490
                                                LR chi2(52)       =   41703.18
                                                Prob > chi2       =     0.0000
Log likelihood = -589812.06                     Pseudo R2         =     0.0341

------------------------------------------------------------------------------
    exposure |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
SABA_only    |  (base outcome)
-------------+----------------------------------------------------------------
ICS__Low_M~_ |
      1.male |   .0020415   .0069143     0.30   0.768    -.0115103    .0155933
        age1 |   .0091314   .0009398     9.72   0.000     .0072895    .0109733
        age2 |   .0177105   .0029704     5.96   0.000     .0118886    .0235325
        age3 |  -.0776247   .0097554    -7.96   0.000    -.0967449   -.0585045
             |
   obese4cat |
Obese I ..)  |    .051121   .0088866     5.75   0.000     .0337035    .0685386
Obese II..)  |   .0553937   .0122176     4.53   0.000     .0314476    .0793399
Obese II..)  |   .0336388   .0152048     2.21   0.027     .0038379    .0634396
             |
smoke_nomiss |
     Former  |  -.0562523   .0075336    -7.47   0.000    -.0710178   -.0414868
    Current  |  -.1924692   .0097056   -19.83   0.000    -.2114919   -.1734465
             |
         imd |
          2  |  -.0009038   .0106258    -0.09   0.932    -.0217298    .0199223
          3  |  -.0037923   .0106343    -0.36   0.721    -.0246352    .0170506
          4  |   .0210953   .0106839     1.97   0.048     .0001551    .0420354
5 most de..  |   .0955281    .010978     8.70   0.000     .0740116    .1170445
             |
         ckd |
        CKD  |   -.122643   .0175451    -6.99   0.000    -.1570308   -.0882553
1.hyperten~n |  -.0617193   .0095261    -6.48   0.000    -.0803901   -.0430485
1.heart_f~re |  -.1108997   .0261808    -4.24   0.000     -.162213   -.0595863
1.other_h~se |  -.1395135   .0150681    -9.26   0.000    -.1690465   -.1099805
             |
     diabcat |
Controlle..  |  -.1931092   .0130864   -14.76   0.000    -.2187582   -.1674602
Uncontrol..  |  -.5091348    .016674   -30.53   0.000    -.5418152   -.4764544
Diabetes,..  |  -.0052135   .0586425    -0.09   0.929    -.1201507    .1097237
             |
1.cancer_e~r |   -.125484   .0152679    -8.22   0.000    -.1554084   -.0955595
    1.statin |   .0783842   .0112821     6.95   0.000     .0562716    .1004967
1.flu_vacc~e |   .7324907    .007394    99.07   0.000     .7179987    .7469827
1.pneumoco~e |   .0257976   .0140147     1.84   0.066    -.0016707    .0532659
1.exacerba~s |    .398764   .0094689    42.11   0.000     .3802054    .4173226
1.immunode~y |   -.257909    .057299    -4.50   0.000     -.370213   -.1456051
       _cons |   .8335791   .0293859    28.37   0.000     .7759838    .8911745
-------------+----------------------------------------------------------------
ICS__High_~_ |
      1.male |   .0136241   .0093282     1.46   0.144    -.0046587     .031907
        age1 |   .0409708   .0014599    28.06   0.000     .0381095    .0438322
        age2 |  -.0416221   .0042916    -9.70   0.000    -.0500334   -.0332108
        age3 |   .0633452    .013693     4.63   0.000     .0365075    .0901829
             |
   obese4cat |
Obese I ..)  |   .1638181   .0116113    14.11   0.000     .1410604    .1865759
Obese II..)  |   .2670198   .0155065    17.22   0.000     .2366276     .297412
Obese II..)  |   .3575801    .018839    18.98   0.000     .3206563    .3945039
             |
smoke_nomiss |
     Former  |  -.0046114   .0099597    -0.46   0.643     -.024132    .0149091
    Current  |  -.0588134   .0133471    -4.41   0.000    -.0849733   -.0326535
             |
         imd |
          2  |   .0481859   .0145175     3.32   0.001     .0197321    .0766396
          3  |   .1188763   .0144251     8.24   0.000     .0906037    .1471489
          4  |   .1918559   .0144135    13.31   0.000     .1636059    .2201058
5 most de..  |   .3249373   .0146524    22.18   0.000     .2962191    .3536554
             |
         ckd |
        CKD  |  -.0943305   .0216921    -4.35   0.000    -.1368463   -.0518147
1.hyperten~n |  -.0184769   .0120928    -1.53   0.127    -.0421783    .0052245
1.heart_f~re |   .0474833   .0317142     1.50   0.134    -.0146755     .109642
1.other_h~se |  -.0630451   .0187742    -3.36   0.001    -.0998419   -.0262483
             |
     diabcat |
Controlle..  |  -.0950103    .016264    -5.84   0.000    -.1268872   -.0631333
Uncontrol..  |   -.439013   .0215667   -20.36   0.000    -.4812829   -.3967431
Diabetes,..  |   .0281593   .0787081     0.36   0.721    -.1261058    .1824244
             |
1.cancer_e~r |  -.1102644   .0194296    -5.68   0.000    -.1483458   -.0721831
    1.statin |   .1161435    .014057     8.26   0.000     .0885924    .1436947
1.flu_vacc~e |   .8186695   .0099525    82.26   0.000      .799163    .8381761
1.pneumoco~e |   .0871765   .0172078     5.07   0.000     .0534498    .1209033
1.exacerba~s |   1.184552   .0111211   106.51   0.000     1.162755    1.206349
1.immunode~y |  -.2632019   .0778529    -3.38   0.001    -.4157908   -.1106129
       _cons |  -2.639731   .0471502   -55.99   0.000    -2.732144   -2.547319
------------------------------------------------------------------------------

. predict p0 p1 p2, pr 

. 
. bysort exposure: summarize p0 

-------------------------------------------------------------------------------
-> exposure = SABA only

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p0 |    108,441    .1597316    .0625448   .0356583   .4248497

-------------------------------------------------------------------------------
-> exposure = ICS (Low/Medium Dose)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p0 |    608,972    .1302556    .0587132   .0347751   .4093407

-------------------------------------------------------------------------------
-> exposure = ICS (High Dose)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p0 |    101,077    .1167185    .0557253   .0349724   .4018212

-------------------------------------------------------------------------------
-> exposure = Other

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p0 |    467,365    .1778984    .0621199    .036474   .4071928


. bysort exposure: summarize p1 

-------------------------------------------------------------------------------
-> exposure = SABA only

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p1 |    108,441    .7314165    .0485647   .4827511   .8380156

-------------------------------------------------------------------------------
-> exposure = ICS (Low/Medium Dose)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p1 |    608,972    .7474859    .0504696   .5157399   .8411467

-------------------------------------------------------------------------------
-> exposure = ICS (High Dose)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p1 |    101,077    .7366509    .0518056   .4973878   .8400003

-------------------------------------------------------------------------------
-> exposure = Other

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p1 |    467,365    .7285936    .0454227   .5212464   .8394457


. bysort exposure: summarize p2 

-------------------------------------------------------------------------------
-> exposure = SABA only

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p2 |    108,441    .1088519    .0469675   .0382187   .3856229

-------------------------------------------------------------------------------
-> exposure = ICS (Low/Medium Dose)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p2 |    608,972    .1222585    .0522926   .0352843   .4148369

-------------------------------------------------------------------------------
-> exposure = ICS (High Dose)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p2 |    101,077    .1466306    .0619802   .0382597   .3912669

-------------------------------------------------------------------------------
-> exposure = Other

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          p2 |    467,365     .093508    .0387936   .0357074   .3834086


. 
. gen check = p0 + p1 + p2 

. summarize check 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       check |  1,285,855           1    6.24e-09   .9999999          1

. 
. * Check PS distribution 
. * Main interest is for p2, but also of interest to plot the other probabiliti
> es 
. 
. * Plot and export graphs of the PS distribution 
. graph twoway kdensity p0 if exposure == 0 || ///
>                          kdensity p0 if exposure == 1 || ///
>                          kdensity p0 if exposure == 2, ///
>                          graphregion(fcolor(white)) ///
>                          legend(size(small) label(1 "P0 - SABA") label (2 "P0
>  - LD ICS") label (3 "P0 - HD ICS") region(lwidth(none))) 

. 
. graph export "$outdir/psplot1.svg", as(svg) replace
(file asthma_output_psm/psplot1.svg written in SVG format)

. graph close

. 
. graph twoway kdensity p1 if exposure == 0 || ///
>                          kdensity p1 if exposure == 1 || ///
>                          kdensity p1 if exposure == 2, ///
>                          graphregion(fcolor(white)) ///
>                          legend(size(small) label(1 "P1 - SABA") label (2 "P1
>  - LD ICS") label (3 "P1 - HD ICS") region(lwidth(none))) 

. 
. graph export "$outdir/psplot2.svg", as(svg) replace
(file asthma_output_psm/psplot2.svg written in SVG format)

. graph close

. 
. graph twoway kdensity p2 if exposure == 0 || ///
>                          kdensity p2 if exposure == 1 || ///
>                          kdensity p2 if exposure == 2, ///
>                          graphregion(fcolor(white)) ///
>                          legend(size(small) label(1 "P2 - SABA") label (2 "P2
>  - LD ICS") label (3 "P2 - HD ICS") region(lwidth(none))) 

. 
. graph export "$outdir/psplot3.svg", as(svg) replace
(file asthma_output_psm/psplot3.svg written in SVG format)

. graph close

. 
. * Estimate and tabulate standardised differences 
. * Note, this relies on the stddiff ado, provided in the repo. 
. * Because 3 level treatment, compare both against baseline, so need to create
>  indicators for this
. 
. gen exposure1v0 = 0 if exposure == 0 
(1,177,414 missing values generated)

. replace exposure1v0 = 1 if exposure == 1 
(608,972 real changes made)

. 
. gen exposure2v0 = 0 if exposure == 0 
(1,177,414 missing values generated)

. replace exposure2v0 = 1 if exposure == 2 
(101,077 real changes made)

. 
. local lab0: label exposure 0

. local lab1: label exposure 1

. local lab2: label exposure 2

. 
. cap file close tablecontent

. file open tablecontent using ./$outdir/table_stddiff.txt, write text replace

. 
. file write tablecontent ("Table S1: Standardised differences before weighting
> ") _n

. file write tablecontent ("Variable") _tab ("SD - `lab1' vs `lab0'") _tab ("SD
>  - `lab2' vs `lab0'") _n 

. 
. *Gender
. 
.     local lab: variable label male 

.     file write tablecontent ("`lab'") _tab

.         
.         stddiff i.male, by(exposure1v0)

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        male |                         |                         |
           0 |     61827        (57.0) |    363526        (59.7) |    0.05440
           1 |     46614        (43.0) |    245446        (40.3) | 
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _tab

.         
.         stddiff i.male, by(exposure2v0)

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        male |                         |                         |
           0 |     61827        (57.0) |     62487        (61.8) |    0.09801
           1 |     46614        (43.0) |     38590        (38.2) | 
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _n 

. 
. *Age
. 
.     local lab: variable label age

.     file write tablecontent ("`lab'") _tab

.         
.         stddiff age, by(exposure1v0)

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     48.31        17.376 |     53.13        17.371 |   -0.27746
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _tab

.         
.         stddiff age, by(exposure2v0)

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     48.31        17.376 |     55.01        16.347 |   -0.39707
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _n 

.         
. * All other things 
. 
. foreach comorb in $varlist {
  2. 
.     local comorb: subinstr local comorb "i." ""
  3.     local lab: variable label `comorb'
  4.     file write tablecontent ("`lab'") _tab
  5.         
.         stddiff `comorb', by(exposure1v0)
  6.         file write tablecontent (r(stddiff)[1,1]) _tab 
  7.         
.         stddiff `comorb', by(exposure2v0)
  8.         file write tablecontent (r(stddiff)[1,1]) _n                      
>       
  9. }

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
   obese4cat |     1.524        .86779 |     1.555        .87727 |   -0.03539
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
   obese4cat |     1.524        .86779 |     1.701        .96676 |   -0.19183
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
smoke_nomiss |      1.77        .74658 |     1.698        .70089 |    0.09949
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
smoke_nomiss |      1.77        .74658 |     1.747         .7065 |    0.03244
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         imd |     3.009        1.4028 |     2.971        1.4104 |    0.02705
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         imd |     3.009        1.4028 |     3.121        1.4089 |   -0.07982
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         ckd |    .04703         .2117 |    .05821        .23414 |   -0.05008
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         ckd |    .04703         .2117 |    .06976        .25474 |   -0.09704
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
hypertension |     .2383        .42605 |     .2899         .4537 |   -0.11714
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
hypertension |     .2383        .42605 |     .3351        .47203 |   -0.21526
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
heart_fai~re |    .01828        .13395 |    .02071        .14242 |   -0.01761
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
heart_fai~re |    .01828        .13395 |    .02964         .1696 |   -0.07436
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
other_hea~se |    .06356        .24396 |     .0721        .25865 |   -0.03398
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
other_hea~se |    .06356        .24396 |    .09051        .28691 |   -0.10120
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     diabcat |     1.195        .52803 |     1.188        .50466 |    0.01362
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     diabcat |     1.195        .52803 |     1.238        .55524 |   -0.08063
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 cancer_ever |    .05257        .22318 |    .06171        .24064 |   -0.03939
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 cancer_ever |    .05257        .22318 |     .0668        .24968 |   -0.06009
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
      statin |     .1669        .37291 |     .2184        .41316 |   -0.13082
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
      statin |     .1669        .37291 |     .2594        .43833 |   -0.22735
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 flu_vaccine |     .3988        .48966 |     .6045        .48896 |   -0.42027
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 flu_vaccine |     .3988        .48966 |     .6437        .47891 |   -0.50554
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
pneumococc~e |    .06082        .23899 |    .08402        .27742 |   -0.08963
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
pneumococc~e |    .06082        .23899 |    .09866         .2982 |   -0.14003
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
exacerbati~s |     .1403        .34726 |     .1998        .39987 |   -0.15906
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
exacerbati~s |     .1403        .34726 |     .3633        .48097 |   -0.53182
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
immunodef_~y |    .00355       .059479 |   .002875       .053545 |    0.01193
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
immunodef_~y |    .00355       .059479 |   .003116       .055738 |    0.00753
------------------------------------------------------------------------------

. 
. file close tablecontent

. 
. /* Create weights============================================================
> =*/
. 
. * ATE weights 
. gen ipw = 1/p0 if exposure == 0 
(1,177,414 missing values generated)

. replace ipw = 1/p1 if exposure == 1 
(608,972 real changes made)

. replace ipw = 1/p2 if exposure == 2 
(101,077 real changes made)

. 
. summarize ipw, d

                             ipw
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1.211471       1.188853
 5%     1.227562       1.189659
10%     1.240706       1.190886       Obs             818,490
25%     1.276803       1.192073       Sum of Wgt.     818,490

50%     1.394287                      Mean           2.998851
                        Largest       Std. Dev.      3.329958
75%     3.635189       26.88253
90%     8.548771       26.95167       Variance       11.08862
95%     10.65451       27.83399       Skewness        2.22804
99%     14.65295       28.04397       Kurtosis       8.002377

. 
. * ATT weights
. * Multiplied by the treatment score in high dose (=p2).  
. gen ipw_att = 1 if exposure == 2
(1,184,778 missing values generated)

. replace ipw_att = p2/p1 if exposure == 1
(608,972 real changes made)

. replace ipw_att = p2/p0 if exposure == 0
(108,441 real changes made)

. 
. summarize ipw_att, d

                           ipw_att
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0685789       .0547218
 5%     .0921243       .0550122
10%     .1070094       .0550122       Obs             818,490
25%     .1242226       .0550122       Sum of Wgt.     818,490

50%     .1590372                      Mean            .371623
                        Largest       Std. Dev.      .4864798
75%     .3727715         8.2729
90%            1       8.349791       Variance       .2366626
95%            1       8.582823       Skewness       4.398933
99%      1.92304       8.701859       Kurtosis       35.44634

. 
. /* Check overlap and standardised differences in the weighted sample=========
> =*/
. 
. * Plot and export graphs of the PS distribution 
. * Left graph export for now for same reason as above 
. * Adapt probability weights to frequency weights to use in graphs
. * These need to be rounded up for sufficient granularity 
. 
. gen ipw_f = round(ipw*100) 
(467,365 missing values generated)

. 
. * repeat for ATT
. 
. gen ipw_fatt = round(ipw_att*100) 
(467,365 missing values generated)

. 
. * Plots in the weighted populations 
. 
. graph twoway kdensity p0 if exposure == 0  [fw = ipw_f] || ///
>                          kdensity p0 if exposure == 1  [fw = ipw_f] || ///
>                          kdensity p0 if exposure == 2  [fw = ipw_f], ///
>                          graphregion(fcolor(white)) ///
>                          legend(size(small) label(1 "P0 - SABA") label (2 "P0
>  - LD ICS") label (3 "P0 - HD ICS") region(lwidth(none))) 

. 
. graph export "$outdir/psplot4.svg", as(svg) replace
(file asthma_output_psm/psplot4.svg written in SVG format)

. graph close

. 
. graph twoway kdensity p1 if exposure == 0  [fw = ipw_f]|| ///
>                          kdensity p1 if exposure == 1  [fw = ipw_f]|| ///
>                          kdensity p1 if exposure == 2  [fw = ipw_f], ///
>                          graphregion(fcolor(white)) ///
>                          legend(size(small) label(1 "P1 - SABA") label (2 "P1
>  - LD ICS") label (3 "P1 - HD ICS") region(lwidth(none))) 

. 
. graph export "$outdir/psplot5.svg", as(svg) replace
(file asthma_output_psm/psplot5.svg written in SVG format)

. graph close

. 
. graph twoway kdensity p2 if exposure == 0  [fw = ipw_f]|| ///
>                          kdensity p2 if exposure == 1  [fw = ipw_f]|| ///
>                          kdensity p2 if exposure == 2  [fw = ipw_f], ///
>                          graphregion(fcolor(white)) ///
>                          legend(size(small) label(1 "P2 - SABA") label (2 "P2
>  - LD ICS") label (3 "P2 - HD ICS") region(lwidth(none))) 

. 
. graph export "$outdir/psplot6.svg", as(svg) replace
(file asthma_output_psm/psplot6.svg written in SVG format)

. graph close

. 
. graph twoway kdensity p0 if exposure == 0  [fw = ipw_fatt] || ///
>                          kdensity p0 if exposure == 1  [fw = ipw_fatt] || ///
>                          kdensity p0 if exposure == 2  [fw = ipw_fatt], ///
>                          graphregion(fcolor(white)) ///
>                          legend(size(small) label(1 "P0 - SABA") label (2 "P0
>  - LD ICS") label (3 "P0 - HD ICS") region(lwidth(none))) 

. 
. graph export "$outdir/psplot7.svg", as(svg) replace
(file asthma_output_psm/psplot7.svg written in SVG format)

. graph close

. 
. graph twoway kdensity p1 if exposure == 0  [fw = ipw_fatt]|| ///
>                          kdensity p1 if exposure == 1  [fw = ipw_fatt]|| ///
>                          kdensity p1 if exposure == 2  [fw = ipw_fatt], ///
>                          graphregion(fcolor(white)) ///
>                          legend(size(small) label(1 "P1 - SABA") label (2 "P1
>  - LD ICS") label (3 "P1 - HD ICS") region(lwidth(none))) 

. 
. graph export "$outdir/psplot8.svg", as(svg) replace
(file asthma_output_psm/psplot8.svg written in SVG format)

. graph close

. 
. graph twoway kdensity p2 if exposure == 0  [fw = ipw_fatt]|| ///
>                          kdensity p2 if exposure == 1  [fw = ipw_fatt]|| ///
>                          kdensity p2 if exposure == 2  [fw = ipw_fatt], ///
>                          graphregion(fcolor(white)) ///
>                          legend(size(small) label(1 "P2 - SABA") label (2 "P2
>  - LD ICS") label (3 "P2 - HD ICS") region(lwidth(none))) 

. 
. graph export "$outdir/psplot9.svg", as(svg) replace
(file asthma_output_psm/psplot9.svg written in SVG format)

. graph close

. 
. 
. * Estimate and tabulate standardised differences 
. * Note, this required amending the stddiff ado file 
. * The amended file is saved as Weighted STDs and called before calculating th
> ese 
. * The weights are frequency weights used above and in a variable called 'wts'
. 
. gen wts = ipw_f
(467,365 missing values generated)

. 
. run "Weighted STDs.do" 

. 
. cap file close tablecontent

. file open tablecontent using ./$outdir/table_stddiff2.txt, write text replace

. 
. file write tablecontent ("Table S2: Standardised differences after weighting 
> - ATE") _n

. file write tablecontent ("Variable") _tab ("SD - `lab1' vs `lab0'") _tab ("SD
>  - `lab2` vs `lab0'") _n 

. 
. *Gender
. 
.     local lab: variable label male 

.     file write tablecontent ("`lab'") _tab

.         
.         stddiff2 i.male, by(exposure1v0)

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        male |                         |                         |
           0 |  4.90e+07        (59.7) |  4.88e+07        (59.6) |    0.00222
           1 |  3.30e+07        (40.3) |  3.31e+07        (40.4) | 
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _tab

.         
.         stddiff2 i.male, by(exposure2v0)

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        male |                         |                         |
           0 |  4.90e+07        (59.7) |  4.87e+07        (59.7) |    0.00040
           1 |  3.30e+07        (40.3) |  3.29e+07        (40.3) | 
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _n 

. 
. *Age
. 
.     local lab: variable label age

.     file write tablecontent ("`lab'") _tab

.         
.         stddiff2 age, by(exposure1v0)

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     53.02        17.493 |     52.73        17.342 |    0.01626
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _tab

.         
.         stddiff2 age, by(exposure2v0)

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     53.02        17.493 |     52.93        17.364 |    0.00502
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _n 

.         
. * All other things 
. 
. foreach comorb in $varlist {
  2. 
.     local comorb: subinstr local comorb "i." ""
  3.     local lab: variable label `comorb'
  4.     file write tablecontent ("`lab'") _tab
  5.         
.         stddiff2 `comorb', by(exposure1v0)
  6.         file write tablecontent (r(stddiff)[1,1]) _tab 
  7.         
.         stddiff2 `comorb', by(exposure2v0)
  8.         file write tablecontent (r(stddiff)[1,1]) _n                      
>       
  9. }

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
   obese4cat |      1.58        .89725 |      1.57        .88929 |    0.01117
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
   obese4cat |      1.58        .89725 |     1.575        .89239 |    0.00468
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
smoke_nomiss |     1.718        .70831 |     1.714        .70842 |    0.00503
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
smoke_nomiss |     1.718        .70831 |     1.726         .7107 |   -0.01162
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         imd |     3.008        1.4102 |     2.995        1.4102 |    0.00878
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         imd |     3.008        1.4102 |     3.003        1.4093 |    0.00326
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         ckd |    .06091        .23916 |    .05821        .23413 |    0.01142
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         ckd |    .06091        .23916 |    .05999        .23747 |    0.00385
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
hypertension |     .2936         .4554 |     .2888        .45321 |    0.01048
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
hypertension |     .2936         .4554 |     .2924        .45488 |    0.00251
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
heart_fai~re |     .0224        .14798 |    .02153        .14515 |    0.00592
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
heart_fai~re |     .0224        .14798 |    .02227        .14757 |    0.00087
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
other_hea~se |    .07646        .26574 |    .07333        .26068 |    0.01189
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
other_hea~se |    .07646        .26574 |    .07524        .26378 |    0.00462
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     diabcat |     1.201        .52181 |     1.195        .51497 |    0.01211
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     diabcat |     1.201        .52181 |     1.199        .51917 |    0.00480
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 cancer_ever |    .06196        .24109 |    .06115        .23961 |    0.00337
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 cancer_ever |    .06196        .24109 |    .06217        .24146 |   -0.00085
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
      statin |     .2216        .41531 |     .2168        .41209 |    0.01144
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
      statin |     .2216        .41531 |     .2196        .41395 |    0.00486
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 flu_vaccine |     .5843        .49285 |      .582        .49323 |    0.00462
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 flu_vaccine |     .5843        .49285 |     .5829        .49308 |    0.00279
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
pneumococc~e |    .08641        .28098 |    .08279        .27557 |    0.01302
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
pneumococc~e |    .08641        .28098 |    .08294         .2758 |    0.01247
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
exacerbati~s |     .2144        .41041 |     .2123        .40894 |    0.00514
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
exacerbati~s |     .2144        .41041 |     .2144        .41041 |   -0.00001
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
immunodef_~y |   .003193       .056413 |   .003004        .05473 |    0.00339
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
immunodef_~y |   .003193       .056413 |   .003031        .05497 |    0.00290
------------------------------------------------------------------------------

. 
. file close tablecontent

. 
. * Repeat for ATT
. 
. drop wts

. gen wts = ipw_fatt
(467,365 missing values generated)

. 
. run "Weighted STDs.do" 

. 
. cap file close tablecontent

. file open tablecontent using ./$outdir/table_stddiff2.txt, write text replace

. 
. file write tablecontent ("Table S3: Standardised differences after weighting 
> - ATT") _n

. file write tablecontent ("Variable") _tab ("SD - `lab1' vs `lab0'") _tab ("SD
>  - `lab2` vs `lab0'") _n 

. 
. *Gender
. 
.     local lab: variable label male 

.     file write tablecontent ("`lab'") _tab

.         
.         stddiff2 i.male, by(exposure1v0)

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        male |                         |                         |
           0 |   6317276        (62.0) |   6254666        (61.9) |    0.00198
           1 |   3879207        (38.0) |   3856440        (38.1) | 
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _tab

.         
.         stddiff2 i.male, by(exposure2v0)

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
        male |                         |                         |
           0 |   6317276        (62.0) |   6248700        (61.8) |    0.00276
           1 |   3879207        (38.0) |   3859000        (38.2) | 
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _n 

. 
. *Age
. 
.     local lab: variable label age

.     file write tablecontent ("`lab'") _tab

.         
.         stddiff2 age, by(exposure1v0)

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     55.44        16.538 |     55.03        16.342 |    0.02453
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _tab

.         
.         stddiff2 age, by(exposure2v0)

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         age |     55.44        16.538 |     55.01        16.347 |    0.02578
------------------------------------------------------------------------------

.         file write tablecontent (r(stddiff)[1,1]) _n 

.         
. * All other things 
. 
. foreach comorb in $varlist {
  2. 
.     local comorb: subinstr local comorb "i." ""
  3.     local lab: variable label `comorb'
  4.     file write tablecontent ("`lab'") _tab
  5.         
.         stddiff2 `comorb', by(exposure1v0)
  6.         file write tablecontent (r(stddiff)[1,1]) _tab 
  7.         
.         stddiff2 `comorb', by(exposure2v0)
  8.         file write tablecontent (r(stddiff)[1,1]) _n                      
>       
  9. }

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
   obese4cat |     1.719        .97784 |     1.702        .96737 |    0.01766
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
   obese4cat |     1.719        .97784 |     1.701        .96676 |    0.01905
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
smoke_nomiss |     1.752        .70582 |     1.749        .70727 |    0.00407
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
smoke_nomiss |     1.752        .70582 |     1.747         .7065 |    0.00752
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         imd |      3.14         1.407 |     3.124         1.409 |    0.01179
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         imd |      3.14         1.407 |     3.121        1.4089 |    0.01351
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         ckd |    .07537        .26398 |    .06997         .2551 |    0.02079
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
         ckd |    .07537        .26398 |    .06976        .25474 |    0.02162
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
hypertension |     .3418         .4743 |     .3359        .47232 |    0.01228
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
hypertension |     .3418         .4743 |     .3351        .47203 |    0.01408
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
heart_fai~re |    .03145        .17454 |    .02988        .17027 |    0.00911
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
heart_fai~re |    .03145        .17454 |    .02964        .16959 |    0.01054
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
other_hea~se |     .0961        .29473 |    .09095        .28754 |    0.01769
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
other_hea~se |     .0961        .29473 |    .09051         .2869 |    0.01923
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     diabcat |     1.247        .56298 |      1.24         .5565 |    0.01328
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
     diabcat |     1.247        .56298 |     1.238        .55524 |    0.01546
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 cancer_ever |    .06804        .25181 |    .06693        .24989 |    0.00442
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 cancer_ever |    .06804        .25181 |     .0668        .24968 |    0.00492
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
      statin |      .265        .44135 |     .2603        .43882 |    0.01066
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
      statin |      .265        .44135 |     .2594        .43833 |    0.01271
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 flu_vaccine |     .6524        .47621 |     .6425        .47925 |    0.02061
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
 flu_vaccine |     .6524        .47621 |     .6437        .47891 |    0.01825
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
pneumococc~e |     .1039        .30508 |    .09843        .29789 |    0.01802
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
pneumococc~e |     .1039        .30508 |    .09866         .2982 |    0.01725
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
exacerbati~s |     .3678         .4822 |     .3642         .4812 |    0.00746
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
exacerbati~s |     .3678         .4822 |     .3633        .48096 |    0.00917
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure1v0=0      |      exposure1v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
immunodef_~y |   .003306         .0574 |    .00313       .055859 |    0.00310
------------------------------------------------------------------------------

------------------------------------------------------------------------------
             |      exposure2v0=0      |      exposure2v0=1      |
             | Mean or N     SD or (%) | Mean or N     SD or (%) |  Std Diff
-------------+-------------------------+-------------------------+------------
immunodef_~y |   .003306         .0574 |   .003116       .055738 |    0.00334
------------------------------------------------------------------------------

. 
. file close tablecontent

. 
. /* Output weighted dataset for analyses======================================
> =*/
. 
. * Save a version set on survival outcome with IP weights (ATE)
. * Note that this will throw a probable error for invalid weights 
. * This is because we have people with missing exposure in the dataset which w
> e allow to drop at this stage
. * Those with missing exposure have missing weights and that's why there's an 
> error 
. stset stime_$outcome [pweight = ipw], fail($outcome) id(patient_id) enter(ent
> er_date) origin(enter_date)        

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=ipw]

------------------------------------------------------------------------------
  1,285,855  total observations
    467,365  weights invalid                                    PROBABLE ERROR
------------------------------------------------------------------------------
    818,490  observations remaining, representing
    818,490  subjects
        529  failures in single-failure-per-subject data
   53964849  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        66

. save $tempdir\analysis_dataset_STSET_IPW_$outcome, replace
file asthma_tempdata_psm\analysis_dataset_STSET_IPW_onscoviddeath.dta saved

. 
. * Save a version weighted on ATT weights
. stset stime_$outcome [pweight = ipw_att], fail($outcome) id(patient_id) enter
> (enter_date) origin(enter_date)    

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date
            weight:  [pweight=ipw_att]

------------------------------------------------------------------------------
  1,285,855  total observations
    467,365  weights invalid                                    PROBABLE ERROR
------------------------------------------------------------------------------
    818,490  observations remaining, representing
    818,490  subjects
        529  failures in single-failure-per-subject data
   53964849  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        66

. save $tempdir\analysis_dataset_STSET_IPWATT_$outcome, replace
file asthma_tempdata_psm\analysis_dataset_STSET_IPWATT_onscoviddeath.dta saved

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\asthma_log_psm\02b_cr
> _derive_ps_asthma.log
  log type:  text
 closed on:  19 Aug 2020, 18:59:10
-------------------------------------------------------------------------------
