---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\asthma_log\00_cr_create
> _analysis_dataset.log
  log type:  text
 opened on:  22 May 2020, 13:54:09

. 
. /* SET FU DATES===============================================================*
> / 
. * Censoring dates for each outcome (largely, last date outcome data available)
. 
. global cpnsdeathcensor          = "23/04/2020"

. global onscoviddeathcensor      = "23/04/2020"

. global indexdate                        = "01/03/2020"

. 
. /* RENAME VARAIBLES===========================================================*
> /
. 
. rename bmi_date_measured                                bmi_date_measured
  (all newnames==oldnames)

. rename bp_dias_date_measured                            bp_dias_date

. rename bp_sys_date_measured                                     bp_sys_date

. 
. /* CONVERT STRINGS TO DATE====================================================*
> /
. /* Comorb dates are given with month only, so adding day 15 to enable
>    them to be processed as dates                                               
>                                            */
. 
. foreach var of varlist  aplastic_anaemia                                ///
>                                                 asthma_ever                    
>                          ///
>                                                 bmi_date_measured              
>                  ///
>                                                 copd                           
>                  ///
>                                                 creatinine_date                
>                  ///
>                                                 diabetes                       
>                  ///
>                                                 haem_cancer                    
>                  ///
>                                                 heart_failure                  
>                  ///
>                                                 hiv                            
>                  ///
>                                                 hypertension                   
>                  ///
>                                                 esrf                           
>                          ///
>                                                 ili                            
>                  ///
>                                                 lung_cancer                    
>                  ///
>                                                 other_cancer                   
>                  ///
>                                                 other_heart_disease            
>                  ///
>                                                 other_respiratory              
>                  ///
>                                                 permanent_immunodeficiency     
>  ///
>                                                 smoking_status_date            
>                  ///
>                                                 temporary_immunodeficiency     
>  ///
>                                                 insulin                        
>                          ///
>                                                 statin                         
>                          ///
>                                                 ics_single                     
>  ///
>                                                 low_med_dose_ics               
>                  ///
>                                                 high_dose_ics                  
>                  ///
>                                                 saba_single                    
>  ///
>                                                 sama_single                    
>  ///
>                                                 laba_single                    
>  ///
>                                                 lama_single                    
>  ///
>                                                 laba_ics                       
>      ///
>                                                 laba_lama                      
>      ///
>                                                 laba_lama_ics                  
>                  ///
>                                                 oral_steroids                  
>                  ///
>                         ltra_single {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-
> 15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable aplastic_anaemia was str7 now str10
(1,298,080 real changes made)
(1,297,940 real changes made)
(1,297,940 missing values generated)
variable asthma_ever was str7 now str10
(1,298,080 real changes made)
(0 real changes made)
variable bmi_date_measured was str7 now str10
(1,298,080 real changes made)
(85,123 real changes made)
(85,123 missing values generated)
variable creatinine_date was str7 now str10
(1,298,080 real changes made)
(198,085 real changes made)
(198,085 missing values generated)
variable diabetes was str7 now str10
(1,298,080 real changes made)
(1,138,223 real changes made)
(1,138,223 missing values generated)
variable haem_cancer was str7 now str10
(1,298,080 real changes made)
(1,290,896 real changes made)
(1,290,896 missing values generated)
variable heart_failure was str7 now str10
(1,298,080 real changes made)
(1,275,564 real changes made)
(1,275,564 missing values generated)
variable hiv was str7 now str10
(1,298,080 real changes made)
(1,275,013 real changes made)
(1,275,013 missing values generated)
variable hypertension was str7 now str10
(1,298,080 real changes made)
(988,139 real changes made)
(988,139 missing values generated)
variable esrf was str7 now str10
(1,298,080 real changes made)
(1,296,312 real changes made)
(1,296,312 missing values generated)
variable ili was str7 now str10
(1,298,080 real changes made)
(1,281,973 real changes made)
(1,281,973 missing values generated)
variable lung_cancer was str7 now str10
(1,298,080 real changes made)
(1,296,515 real changes made)
(1,296,515 missing values generated)
variable other_cancer was str7 now str10
(1,298,080 real changes made)
(1,237,407 real changes made)
(1,237,407 missing values generated)
variable other_heart_disease was str7 now str10
(1,298,080 real changes made)
(1,218,591 real changes made)
(1,218,591 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(1,298,080 real changes made)
(1,296,469 real changes made)
(1,296,469 missing values generated)
variable smoking_status_date was str7 now str10
(1,298,080 real changes made)
(2,133 real changes made)
(2,133 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(1,298,080 real changes made)
(1,297,664 real changes made)
(1,297,664 missing values generated)
variable insulin was str7 now str10
(1,298,080 real changes made)
(1,275,100 real changes made)
(1,275,100 missing values generated)
variable statin was str7 now str10
(1,298,080 real changes made)
(1,075,782 real changes made)
(1,075,782 missing values generated)
variable ics_single was str7 now str10
(1,298,080 real changes made)
(1,004,747 real changes made)
(1,004,747 missing values generated)
variable low_med_dose_ics was str7 now str10
(1,298,080 real changes made)
(676,339 real changes made)
(676,339 missing values generated)
variable high_dose_ics was str7 now str10
(1,298,080 real changes made)
(1,193,261 real changes made)
(1,193,261 missing values generated)
variable saba_single was str7 now str10
(1,298,080 real changes made)
(686,649 real changes made)
(686,649 missing values generated)
variable sama_single was str7 now str10
(1,298,080 real changes made)
(1,295,235 real changes made)
(1,295,235 missing values generated)
variable laba_single was str7 now str10
(1,298,080 real changes made)
(1,289,502 real changes made)
(1,289,502 missing values generated)
variable lama_single was str7 now str10
(1,298,080 real changes made)
(1,281,570 real changes made)
(1,281,570 missing values generated)
variable laba_ics was str7 now str10
(1,298,080 real changes made)
(862,767 real changes made)
(862,767 missing values generated)
variable laba_lama was str7 now str10
(1,298,080 real changes made)
(1,297,718 real changes made)
(1,297,718 missing values generated)
variable laba_lama_ics was str7 now str10
(1,298,080 real changes made)
(1,296,802 real changes made)
(1,296,802 missing values generated)
variable oral_steroids was str7 now str10
(1,298,080 real changes made)
(1,183,557 real changes made)
(1,183,557 missing values generated)
variable ltra_single was str7 now str10
(1,298,080 real changes made)
(1,227,578 real changes made)
(1,227,578 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. /* RENAME VARAIBLES===========================================================*
> /
. *  An extra 'date' added to the end of some variable names, remove 
. 
. rename creatinine_date_date             creatinine_measured_date

. rename smoking_status_date_date         smoking_status_measured_date

. rename bmi_date_measured_date           bmi_measured_date

. 
. * Some names too long for loops below, shorten
. 
. rename permanent_immunodeficiency_date perm_immunodef_date

. rename temporary_immunodeficiency_date temp_immunodef_date

. 
. /* CREATE BINARY VARIABLES====================================================*
> /
. *  Make indicator variables for all conditions 
. 
. foreach var of varlist  aplastic_anaemia_date                           ///
>                                                 asthma_ever_date               
>                          ///
>                                                 bmi_measured_date              
>                          ///
>                                                 copd_date                      
>                  ///
>                                                 creatinine_measured_date       
>                  ///
>                                                 diabetes_date                  
>                  ///
>                                                 haem_cancer_date               
>                  ///
>                                                 heart_failure_date             
>                          ///
>                                                 hiv_date                       
>                  ///
>                                                 hypertension_date              
>                  ///
>                                                 esrf_date                      
>                                  ///
>                                                 ili_date                       
>                  ///
>                                                 lung_cancer_date               
>                  ///
>                                                 other_cancer_date              
>                  ///
>                                                 other_heart_disease_date       
>                  ///
>                                                 other_respiratory_date         
>                  ///
>                                                 perm_immunodef_date            
>                  ///
>                                                 smoking_status_measured_date   
>          ///
>                                                 temp_immunodef_date            
>                  ///
>                                                 insulin_date                   
>                          ///
>                                                 statin_date                    
>                          ///
>                                                 ics_single_date                
>      ///
>                                                 low_med_dose_ics_date          
>                  ///
>                                                 high_dose_ics_date             
>                          ///
>                                                 saba_single_date               
>      ///
>                                                 sama_single_date               
>      ///
>                                                 laba_single_date               
>      ///
>                                                 lama_single_date               
>      ///
>                                                 laba_ics_date                  
>      ///
>                                                 laba_lama_date                 
>      ///
>                                                 laba_lama_ics_date             
>                          ///
>                                                 oral_steroids_date             
>                          ///
>                         ltra_single_date {
  2.         
.         /* date ranges are applied in python, so presence of date indicates pre
> sence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. /* CREATE VARIABLES===========================================================*
> /
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(758,001 missing values generated)

. replace male = 0 if sex == "F"
(757,969 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(286,951 real changes made, 286,951 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                      
>                  ///
>                                                 3 "Asian or Asian British"     
>  ///
>                                                 4 "Black"                      
>                  ///
>                                                 5 "Other"                      
>                  ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(1,298,048 missing values generated)

. replace stp = sum(stp)
(1,298,079 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(1,298,080 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(12,586 real changes made, 12,586 to missing)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 1027009 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u 
> "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(1298080 differences between age and agegroup)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Create binary age
. recode age min/69.999 = 0 ///
>            70/max = 1, gen(age70)
(1298080 differences between age and age70)

. 
. * Check there are no missing ages
. assert age < .

. assert agegroup < .

. assert age70 < .

. 
. * Create restricted cubic splines fir age
. mkspline age = age, cubic nknots(4)

. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(89,245 real changes made, 89,245 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(16,887 real changes made, 16,887 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(85,123 missing values generated)

. gen bmi_age = age - bmi_time
(85,123 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(6,587 real changes made, 6,587 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(27,596 real changes made, 27,596 to missing)

. replace bmi_measured_date = . if bmi == . 
(0 real changes made)

. 
. gen     bmicat = .
(1,298,080 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 19340 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 344398 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 398686 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 241443 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 113101 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 68393 changes made)

. replace bmicat = .u if bmi >= .
(112,719 real changes made, 112,719 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                    
>  ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(1278740 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"          
>  ///
>                                                 3 "Obese II (35-39.9)"         
>  ///
>                                                 4 "Obese III (40+)"            
>  

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(701,885 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(502,605 real changes made)

. replace smoke = 3  if smoking_status == "S"
(197,147 real changes made)

. replace smoke = .u if smoking_status == "M"
(2,133 real changes made, 2,133 to missing)

. replace smoke = .u if smoking_status == "" 
(0 real changes made)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(2133 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /* Exacerbation */ 
. replace exacerbations = 0 if exacerbations == . 
(0 real changes made)

. replace exacerbation_count = 0 if exacerbation_count <1 
(0 real changes made)

. 
. /* GP consultation rate */ 
. replace gp_consult_count = 0 if gp_consult_count <1 
(0 real changes made)

. 
. * those with no count assumed to have no visits 
. replace gp_consult_count = 0 if gp_consult_count == . 
(0 real changes made)

. gen gp_consult = (gp_consult_count >=1)

. 
. /*  Cancer  */
. 
. gen cancer_ever =   (haem_cancer == 1 | /// 
>                      lung_cancer == 1 | /// 
>                                          other_cancer ==1)              

.                                          
. gen cancer_ever_date = max(haem_cancer_date, lung_cancer_date, other_cancer_dat
> e)
(1,230,288 missing values generated)

. format cancer_ever_date %td

. 
. /* Vaccines */ 
. replace pneumococcal_vaccine = 0 if pneumococcal_vaccine == . 
(0 real changes made)

. replace flu_vaccine = 0 if flu_vaccine == . 
(0 real changes made)

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * HIV, permanent immunodeficiency ever, OR 
. * temporary immunodeficiency or aplastic anaemia last year
. gen temp1  = max(hiv, perm_immunodef)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), da
> te("$indexdate", "DMY"))

. gen temp3  = inrange(aplastic_anaemia_date, (date("$indexdate", "DMY") - 365), 
> date("$indexdate", "DMY"))

. 
. egen immunodef_any = rowmax(temp1 temp2 temp3)

. drop temp1 temp2 temp3

. order immunodef_any, after(temp_immunodef_date)

. 
. /* eGFR */
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(200,827 real changes made, 200,827 to missing)

. 
. * Remove creatinine dates if no measurements, and vice versa 
. 
. replace creatinine = . if creatinine_measured_date == . 
(0 real changes made)

. replace creatinine_measured_date = . if creatinine == . 
(2,742 real changes made, 2,742 to missing)

. replace creatinine_measured = . if creatinine == . 
(200,827 real changes made, 200,827 to missing)

. 
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(200,827 missing values generated)

. 
. gen min = .
(1,298,080 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(675,222 real changes made)

. replace min = SCr_adj/0.9 if male==1
(422,006 real changes made)

. replace min = min^-0.329  if male==0
(675,222 real changes made)

. replace min = min^-0.411  if male==1
(422,006 real changes made)

. replace min = 1 if min<1
(723,624 real changes made)

. 
. gen max=.
(1,298,080 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(675,222 real changes made)

. replace max=SCr_adj/0.9 if male==1
(422,006 real changes made)

. replace max=max^-1.209
(1,097,228 real changes made)

. replace max=1 if max>1
(574,456 real changes made)

. 
. gen egfr=min*max*141
(200,852 missing values generated)

. replace egfr=egfr*(0.993^age)
(1,097,228 real changes made)

. replace egfr=egfr*1.018 if male==0
(675,222 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(200852 missing values generated)

. recode egfr_cat 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(1097228 differences between egfr_cat and ckd_egfr)

. 
. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. 
. * Add in end stage renal failure and create a single CKD variable 
. gen ckd = 1 if esrf == 1
(1,296,312 missing values generated)

. replace ckd = 0 if esrf == 0
(1,296,312 real changes made)

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(72,475 real changes made)

. replace ckd = 0 if ckd_egfr == .
(38 real changes made)

. replace ckd = 0 if ckd_egfr < 1
(492 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "CKD stage calc without eth"

. 
. * Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_measured_date if ckd_egfr >=1
(1,224,342 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(1,296,312 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(1,223,812 missing values generated)

. format ckd_date %td 

. 
. /* OUTCOME AND SURVIVAL TIME==================================================*
> /
. 
. /*  Cohort entry and censor dates  */
. 
. * Date of cohort entry, 1 Mar 2020
. gen enter_date = date("$indexdate", "DMY")

. 
. * Date of study end (typically: last date of outcome data available)
. **** NOTE!! ITU ADMISSION TO BE REPLACED WITH ECDS OUTCOME 
. gen cpnsdeathcensor_date                = date("$cpnsdeathcensor",             
>  "DMY")

. gen onscoviddeathcensor_date    = date("$onscoviddeathcensor",  "DMY")

. 
. * Format the dates
. format  enter_date                                      ///
>                 cpnsdeathcensor_date            ///
>                 onscoviddeathcensor_date        %td

. 
. /*   Outcomes   */
. 
. * Dates of: ITU admission, CPNS death, ONS-covid death
. * Recode to dates from the strings 
. foreach var of varlist  died_date_ons           ///
>                                                 died_date_cpns          ///
>                                                 {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td 
  7.         
. }
(1,295,898 missing values generated)
(1,297,674 missing values generated)

. 
. * Date of Covid death in ONS
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any == 1
(1,297,472 missing values generated)

. 
. format died_date_ons %td

. format died_date_onscovid %td 

. 
. * Binary indicators for outcomes
. gen cpnsdeath           = (died_date_cpns               < .)

. gen onscoviddeath       = (died_date_onscovid   < .)

. 
. /*  Create survival times  */
. 
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcome)
. gen stime_cpnsdeath     = min(cpnsdeathcensor_date,     died_date_cpns, died_da
> te_ons)

. gen stime_onscoviddeath = min(onscoviddeathcensor_date,                        
>          died_date_ons)

. 
. * If outcome was after censoring occurred, set to zero
. replace cpnsdeath               = 0 if (died_date_cpns          > cpnsdeathcens
> or_date) 
(15 real changes made)

. replace onscoviddeath   = 0 if (died_date_onscovid      > onscoviddeathcensor_d
> ate) 
(93 real changes made)

. 
. * Format date variables
. format  stime* %td 

. 
. /* LABEL VARIABLES============================================================*
> /
. *  Label variables you are intending to keep, drop the rest 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age70                                         "70 years and older"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI, 
> kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date mea
> sured"

. label var obese4cat                                     "Evidence of obesity (4
>  categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set to
>  non)"

. label var imd                                           "Index of Multiple Depr
> ivation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and Tra
> nsformation Partnership"

. 
. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. 
. * Treatment variables 
. 
. label var high_dose_ics                         "High Dose ICS"

. label var low_med_dose_ics                      "Low/Medium Dose ICS"

. label var ics_single                    "Single ICS"

. label var saba_single                           "Single SABA"

. label var sama_single                   "Single SAMA"

. label var laba_single                           "Single LABA"

. label var lama_single                           "Single LAMA"

. label var laba_ics                                      "LABA ICS"             
>  

. label var laba_lama                             "LABA LAMA"

. label var laba_lama_ics                         "LABA LAMA ICS"

. label var ltra_single                           "Single LTRA"

. 
. label var oral_steroids                         "Oral Steroids"

. 
. label var high_dose_ics_date            "High Dose ICS Date"

. label var low_med_dose_ics_date         "Low/Medium Dose ICS Date"

. label var ics_single_date               "Single ICS Date"

. label var saba_single_date                      "Single SABA Date"

. label var sama_single_date              "Single SAMA Date"

. label var laba_single_date                      "Single LABA Date"

. label var lama_single_date                      "Single LAMA Date"

. label var laba_ics_date                         "LABA ICS Date"         

. label var laba_lama_date                        "LABA LAMA Date"

. label var laba_lama_ics_date            "LABA LAMA ICS Date"

. label var ltra_single_date                      "Single LTRA Date"

. 
. label var oral_steroids_date                    "Oral Steroids Date"

. 
. * Comorbidities of interest 
. label var asthma_ever                                   "Asthma ever"

. label var ckd                                                   "Chronic kidney
>  disease" 

. label var egfr_cat                                              "Calculated eGF
> R"

. label var hypertension                              "Diagnosed hypertension"

. label var heart_failure                             "Heart Failure"

. label var ili                                                   "Infleunza Like
>  Illness"

. label var other_respiratory                     "Other Respiratory Diseases"

. label var other_heart_disease                   "Other Heart Diseases"

. label var copd                                                  "COPD"

. label var diabetes                                              "Diabetes"

. label var cancer_ever                                   "Cancer"

. label var immunodef_any                                 "Immunosuppressed (comb
> ination algorithm)"

. 
. label var statin                                                "Recent Statin"

. label var insulin                                               "Recent Insulin
> "

. label var flu_vaccine                                   "Flu vaccine"

. label var pneumococcal_vaccine                  "Pneumococcal Vaccine"

. label var gp_consult                                    "GP consultation in las
> t year"

. label var gp_consult_count                              "GP consultation count"

. label var exacerbations                                 "Exacerbation in last y
> ear"

. label var exacerbation_count                    "Exacerbation Count"

. 
. label var asthma_ever_date                              "Asthma date"

. label var ckd_date                                      "Chronic kidney disease
>  Date" 

. label var hypertension_date                         "Diagnosed hypertension Dat
> e"

. label var heart_failure_date                    "Heart Failure Date"

. label var ili_date                                              "Infleunza Like
>  Illness Date"

. label var other_respiratory_date                "Other Respiratory Diseases Dat
> e"

. label var other_heart_disease_date              "Other Heart Diseases Date"

. label var copd_date                                     "COPD Date"

. label var diabetes_date                                 "Diabetes Date"

. label var cancer_ever_date                              "Cancer Date"

. 
. label var statin_date                                   "Recent Statin Date"

. label var insulin_date                                  "Recent Insulin Date"

. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. label var cpnsdeathcensor_date                  "Date of admin censoring for cp
> ns deaths"

. label var onscoviddeathcensor_date              "Date of admin censoring for ON
> S deaths"

. 
. label var cpnsdeath                                             "Failure/censor
> ing indicator for outcome: CPNS covid death"

. label var onscoviddeath                                 "Failure/censoring indi
> cator for outcome: ONS covid death"

. 
. label var died_date_cpns                                "Date of CPNS Death"

. label var died_date_onscovid                    "Date of ONS Death"

. 
. * Survival times
. label var  stime_cpnsdeath                              "Survival time (date); 
> outcome CPNS covid death"

. label var  stime_onscoviddeath                  "Survival time (date); outcome 
> ONS covid death"

. 
. /* TIDY DATA==================================================================*
> /
. *  Drop variables that are needed (those labelled)
. ds, not(varlabel)
icu_date_a~d  bp_dias       hiv_date      esrf          SCr_adj
died_ons_c~y  bp_dias_date  hiv           flu_vacci~le  min
died_ons_c~g  lung_cance~e  perm_immun~e  flu_vaccin~d  max
ethnicity_~e  lung_cancer   perm_immun~f  flu_vaccin~l  temp1_ckd_~e
bmi_measured  haem_cance~e  temp_immun~e  pneumococ~le  temp2_ckd_~e
smoking_st~e  haem_cancer   temp_immun~f  pneumococc~d  died_dat~ons
smoking_st~d  other_canc~e  creatinine    pneumococc~l
high_dose_~g  other_cancer  creatinine~e  has_consul~y
bp_sys        aplastic_a~e  creatinine~d  bmi_time
bp_sys_date   aplastic_a~a  esrf_date     bmi_age

. drop `r(varlist)'

.         
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\asthma_log\00_cr_create
> _analysis_dataset.log
  log type:  text
 closed on:  22 May 2020, 13:55:35
---------------------------------------------------------------------------------
