--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\asthma_log\02_cr_create_asthma_exposure.log
  log type:  text
 opened on:  22 May 2020, 09:18:18

. 
. /* TREATMENT EXPOSURE=========================================================*/        
. 
. /* SABA ONLY */ 
. 
. * At least one prescription of SABA single 
. gen exposure = 0 if saba_single == 1
(679,440 missing values generated)

. 
. * And not a LABA, ICS or LTRA single or in combination 
. recode exposure(0 = .u) if ics_single == 1 
(exposure: 214147 changes made)

. recode exposure(0 = .u) if laba_ics == 1 
(exposure: 280317 changes made)

. recode exposure(0 = .u) if laba_lama == 1
(exposure: 8 changes made)

. recode exposure(0 = .u) if laba_lama_ics == 1 
(exposure: 652 changes made)

. recode exposure(0 = .u) if ltra_single == 1 
(exposure: 2476 changes made)

. 
. /* ICS */
.                                 
. * Most recent low or high dose before index
. 
. replace exposure = 1 if low_med_dose_ics == 1 & ///
>                                                 low_med_dose_ics_date == max(low_med_dose_ics_date, hi
> gh_dose_ics_date)
(611,268 real changes made)

. replace exposure = 2 if high_dose_ics == 1 & /// 
>                                                 high_dose_ics_date == max(low_med_dose_ics_date, high_
> dose_ics_date)    
(101,047 real changes made)

. 
. * If both on same date, code above assumes high dose            
. 
. replace exposure = .u if exposure >= .
(464,767 real changes made, 464,767 to missing)

.                                                 
. label define exposure 0 "SABA only" 1 "ICS (Low/Medium Dose)" 2 "ICS (High Dose)" .u "Other"

. label values exposure exposure 

. 
. label var exposure "Asthma Treatment Exposure"

. 
. /* SAVE DATA==================================================================*/        
. 
. sort patient_id

. save $tempdir\analysis_dataset, replace
file asthma_tempdata\analysis_dataset.dta saved

. 
. * Save a version set on CPNS survival outcome
. stset stime_cpnsdeath, fail(cpnsdeath) id(patient_id) enter(enter_date) origin(enter_date)      

                id:  patient_id
     failure event:  cpnsdeath != 0 & cpnsdeath < .
obs. time interval:  (stime_cpnsdeath[_n-1], stime_cpnsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
  1,285,462  total observations
         24  observations end on or before enter()
------------------------------------------------------------------------------
  1,285,438  observations remaining, representing
  1,285,438  subjects
        391  failures in single-failure-per-subject data
   68084633  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        53

. save $tempdir\analysis_dataset_STSET_cpnsdeath, replace
file asthma_tempdata\analysis_dataset_STSET_cpnsdeath.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\asthma_log\02_cr_create_asthma_exposure.log
  log type:  text
 closed on:  22 May 2020, 09:18:41
--------------------------------------------------------------------------------------------------------
