---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\asthma_log\08_an_model_
> checks_asthma.log
  log type:  text
 opened on:  22 May 2020, 14:05:15

. 
. * Open Stata dataset
. use $tempdir\analysis_dataset_STSET_cpnsdeath, clear

. 
. * Exposure labels 
. local lab1: label exposure 1

. local lab2: label exposure 2

. 
. /* Quietly run models, perform test and store results in local macro==========*
> /
. 
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.05036         0.81        1         0.3684
      2.exposure  |      0.02177         0.15        1         0.6974
      ------------+---------------------------------------------------
      global test |                      1.05        2         0.5923
      ----------------------------------------------------------------

. local univar_p1 = round(r(phtest)[2,4],0.001)

. local univar_p2 = round(r(phtest)[3,4],0.001)

. 
. di `univar_p1'
.368

. di `univar_p2'
.697

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Shoenfeld Residuals", size(small)) ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univariabl
> e `lab1'", position(11) size(medsmall)) 

. 
. graph export "$outdir/schoenplot1a.svg", as(svg) replace
(file asthma_output/schoenplot1a.svg written in SVG format)

. 
. estat phtest, plot(2.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Shoenfeld Residuals", size(small)) ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univariabl
> e `lab2'", position(11) size(medsmall)) 

. 
. graph export "$outdir/schoenplot1b.svg", as(svg) replace
(file asthma_output/schoenplot1b.svg written in SVG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  cpnsdeath
   analysis time _t:  (stime_cpnsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4342.7867
Iteration 1:   log likelihood = -4100.2402
Iteration 2:   log likelihood = -4065.1268
Iteration 3:   log likelihood = -4062.2315
Iteration 4:   log likelihood = -4061.8055
Iteration 5:   log likelihood = -4061.7786
Iteration 6:   log likelihood = -4061.7785
Iteration 7:   log likelihood = -4061.7785
Refining estimates:
Iteration 0:   log likelihood = -4061.7785

Cox regression -- Breslow method for ties

No. of subjects =      818,200                  Number of obs    =     818,200
No. of failures =          319
Time at risk    =     43331502
                                                LR chi2(6)       =      562.02
Log likelihood  =   -4061.7785                  Prob > chi2      =      0.0000

--------------------------------------------------------------------------------
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      exposure |
ICS (Low/M..)  |   1.003462   .1952969     0.02   0.986     .6852312    1.469482
ICS (High ..)  |   1.615972   .3580049     2.17   0.030     1.046784    2.494654
               |
        1.male |   1.703774   .1920232     4.73   0.000     1.366085    2.124939
          age1 |   1.107811   .0768662     1.48   0.140     .9669508    1.269191
          age2 |   .9504284   .1392402    -0.35   0.729      .713208    1.266551
          age3 |   1.170656   .4579429     0.40   0.687     .5438161    2.520034
--------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.05624         1.01        1         0.3141
      2.exposure  |      0.02694         0.23        1         0.6301
      0b.male     |            .            .        1             .
      1.male      |     -0.11611         4.37        1         0.0365
      age1        |      0.08523         1.24        1         0.2660
      age2        |     -0.11297         2.32        1         0.1280
      age3        |      0.11985         2.73        1         0.0983
      ------------+---------------------------------------------------
      global test |                     10.83        6         0.0938
      ----------------------------------------------------------------

. local multivar1_p1 = round(r(phtest)[2,4],0.001)

. local multivar1_p2 = round(r(phtest)[3,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Shoenfeld Residuals", size(small)) ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and se
> x adjusted `lab1'", position(11) size(medsmall))                           

. 
. graph export "$outdir/schoenplot2a.svg", as(svg) replace
(file asthma_output/schoenplot2a.svg written in SVG format)

. 
. estat phtest, plot(2.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Shoenfeld Residuals", size(small)) ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and se
> x adjusted `lab2'", position(11) size(medsmall))                           

. 
. graph export "$outdir/schoenplot2b.svg", as(svg) replace
(file asthma_output/schoenplot2b.svg written in SVG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3  i.obese4cat                            
>          ///
>                                                                                
>  i.smoke_nomiss                          ///
>                                                                                
>  i.imd                                           ///
>                                                                                
>  i.ckd                                           ///             
>                                                                                
>  i.hypertension                          ///             
>                                                                                
>  i.heart_failure                         ///             
>                                                                                
>  i.other_heart_disease           ///             
>                                                                                
>  i.diabetes                                      ///             
>                                                                                
>  i.cancer_ever                           ///                                   
>   
>                                                                                
>  i.statin                                        ///             
>                                                                                
>  i.insulin                                       ///             
>                                                                                
>  i.flu_vaccine                           ///     
>                                                                                
>  i.pneumococcal_vaccine          ///
>                                                                                
>  i.exacerbations                         ///
>                                                                                
>  i.gp_consult, strata(stp)       

         failure _d:  cpnsdeath
   analysis time _t:  (stime_cpnsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3295.0444
Iteration 1:   log likelihood = -3026.5828
Iteration 2:   log likelihood = -2919.5149
Iteration 3:   log likelihood = -2916.9443
Iteration 4:   log likelihood = -2916.9012
Iteration 5:   log likelihood = -2916.9008
Iteration 6:   log likelihood = -2916.9008
Refining estimates:
Iteration 0:   log likelihood = -2916.9008

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      818,200                  Number of obs    =     818,200
No. of failures =          319
Time at risk    =     43331502
                                                LR chi2(27)      =      756.29
Log likelihood  =   -2916.9008                  Prob > chi2      =      0.0000

--------------------------------------------------------------------------------
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      exposure |
ICS (Low/M..)  |   1.126018   .2199112     0.61   0.543     .7679019    1.651144
ICS (High ..)  |   1.490464   .3332426     1.78   0.074     .9616283    2.310127
               |
        1.male |   1.750554   .2053202     4.77   0.000     1.391038    2.202986
          age1 |   1.106536   .0783163     1.43   0.153     .9632099     1.27119
          age2 |   .9154169    .137581    -0.59   0.557     .6818502    1.228991
          age3 |   1.293854   .5210296     0.64   0.522     .5876378    2.848791
               |
     obese4cat |
Obese I (3..)  |   1.387394   .1893007     2.40   0.016     1.061839    1.812761
Obese II (..)  |   1.268519   .2499768     1.21   0.227     .8621003    1.866536
Obese III ..)  |   2.274901   .4739637     3.95   0.000     1.512234    3.422204
               |
  smoke_nomiss |
       Former  |   1.173079   .1395818     1.34   0.180     .9290623    1.481186
      Current  |    .540505   .1818175    -1.83   0.067     .2795559    1.045035
               |
           imd |
            2  |   1.148854   .2373061     0.67   0.502     .7663749    1.722218
            3  |   1.499394   .2928841     2.07   0.038      1.02246    2.198798
            4  |   1.772457   .3422746     2.96   0.003     1.213955     2.58791
5 most depr..  |   1.839767   .3739285     3.00   0.003     1.235259    2.740108
               |
           ckd |
          CKD  |   1.760955   .2386124     4.18   0.000     1.350234    2.296611
1.hypertension |   1.189236   .1630889     1.26   0.206     .9089423    1.555965
1.heart_fai~re |   1.658497   .2800049     3.00   0.003     1.191258    2.308998
1.other_hea~se |   1.141922   .1594686     0.95   0.342     .8684941    1.501434
    1.diabetes |    2.12785    .276932     5.80   0.000     1.648771    2.746135
 1.cancer_ever |   1.497923   .2163706     2.80   0.005      1.12859    1.988122
      1.statin |   1.029482   .1327432     0.23   0.822     .7995822    1.325483
     1.insulin |   1.264986   .2685493     1.11   0.268     .8344119    1.917746
 1.flu_vaccine |   .9525334   .1269368    -0.36   0.715     .7335794    1.236839
1.pneumococc~e |   .7876265   .1634328    -1.15   0.250     .5244398    1.182892
1.exacerbati~s |   1.293634   .1621562     2.05   0.040     1.011844    1.653899
  1.gp_consult |   1.034751    .470937     0.08   0.940     .4240684     2.52485
--------------------------------------------------------------------------------
                                                             Stratified by stp

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.04319         0.59        1         0.4408
      2.exposure  |      0.01952         0.12        1         0.7265
      0b.male     |            .            .        1             .
      1.male      |     -0.10469         3.54        1         0.0599
      age1        |      0.09278         1.52        1         0.2171
      age2        |     -0.12356         2.97        1         0.0850
      age3        |      0.13016         3.48        1         0.0619
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.06104         1.17        1         0.2787
      3.obese4cat |     -0.04199         0.55        1         0.4586
      4.obese4cat |     -0.00246         0.00        1         0.9650
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.05247         0.85        1         0.3556
      3.smoke_no~s|     -0.01742         0.10        1         0.7532
      1b.imd      |            .            .        1             .
      2.imd       |      0.04505         0.64        1         0.4230
      3.imd       |      0.07491         1.77        1         0.1836
      4.imd       |      0.06529         1.35        1         0.2448
      5.imd       |      0.08295         2.10        1         0.1471
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.00341         0.00        1         0.9493
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.02572         0.23        1         0.6300
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.01781         0.11        1         0.7415
      0b.other_~se|            .            .        1             .
      1.other_h~se|     -0.08781         2.58        1         0.1079
      0b.diabetes |            .            .        1             .
      1.diabetes  |      0.01669         0.09        1         0.7644
      0b.cancer_~r|            .            .        1             .
      1.cancer_e~r|      0.09710         3.09        1         0.0787
      0b.statin   |            .            .        1             .
      1.statin    |      0.08589         2.52        1         0.1123
      0b.insulin  |            .            .        1             .
      1.insulin   |     -0.10110         3.26        1         0.0708
      0b.flu_vac~e|            .            .        1             .
      1.flu_vacc~e|      0.09669         3.10        1         0.0781
      0b.pneumoc~e|            .            .        1             .
      1.pneumoco~e|     -0.03260         0.33        1         0.5635
      0b.exacerb~s|            .            .        1             .
      1.exacerba~s|     -0.03308         0.35        1         0.5568
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|     -0.02328         0.18        1         0.6701
      ------------+---------------------------------------------------
      global test |                     30.78       27         0.2801
      ----------------------------------------------------------------

. local multivar2_p1 = round(r(phtest)[2,4],0.001)

. local multivar2_p2 = round(r(phtest)[3,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Shoenfeld Residuals", size(small)) ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) /// 
>                           title ("Schoenfeld residuals against time, fully adju
> sted `lab1'", position(11) size(medsmall))                 

.                           
. graph export "$outdir/schoenplot3a.svg", as(svg) replace
(note: file asthma_output/schoenplot3a.svg not found)
(file asthma_output/schoenplot3a.svg written in SVG format)

. 
. estat phtest, plot(2.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Shoenfeld Residuals", size(small)) ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully adju
> sted `lab2'", position(11) size(medsmall))                 

.                           
. graph export "$outdir/schoenplot3b.svg", as(svg) replace
(note: file asthma_output/schoenplot3b.svg not found)
(file asthma_output/schoenplot3b.svg written in SVG format)

. 
. * Close window 
. graph close

. 
. * Print table of results======================================================*
> /        
. 
. 
. cap file close tablecontent

. file open tablecontent using ./$outdir/table4.txt, write text replace
(note: file ./asthma_output/table4.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 4: Testing the PH assumption - $population Popu
> lation") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab ///
>                                                 ("Age/Sex and Comorbidity Adjus
> ted") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _tab
>  _n

. 
. * Row heading and content  
. file write tablecontent ("`lab1'") _tab

. file write tablecontent ("`univar_p1'") _tab ("`multivar1_p1'") _tab ("`multiva
> r2_p1'") _n

. 
. file write tablecontent ("`lab2'") _tab

. file write tablecontent ("`univar_p2'") _tab ("`multivar1_p2'") _tab ("`multiva
> r2_p2'") _n

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\asthma_log\08_an_model_
> checks_asthma.log
  log type:  text
 closed on:  22 May 2020, 14:16:07
---------------------------------------------------------------------------------
