----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\copd_log_sens1\S1-02_cr_create_copd_exposure.log
  log type:  text
 opened on:  24 Jul 2020, 10:25:34

. 
. /* TREATMENT EXPOSURE=========================================================*/        
. 
. /* LABA LAMA */ 
. gen exposure = .u
(292,097 missing values generated)

. 
. * At least one prescription in LABA-LAMA combination list 
. replace exposure = 0 if laba_lama == 1 
(46,184 real changes made)

. * OR at least one prescription of LABA AND at least one prescription of LAMA
. replace exposure = 0 if laba_single == 1 & lama_single == 1 
(2,249 real changes made)

.                                                 
. * AND no prescription for an ICS 
. recode exposure(0 = .u) if ics_single == 1 
(exposure: 1493 changes made)

. recode exposure(0 = .u) if laba_ics == 1 
(exposure: 1905 changes made)

. recode exposure(0 = .u) if laba_lama_ics == 1 
(exposure: 1727 changes made)

. 
. /* Dual combination ICS */
.                                 
. * Any prescription for a LABA ICS combination product 
. replace exposure = 1 if laba_ics == 1 
(75,552 real changes made)

. * OR Any prescription for single ICS + Single LABA
. replace exposure = 1 if ics_single == 1 & laba_single == 1 
(426 real changes made)

. 
. * Note: ICS and LAMA only considered "Other", as per protocol                                   
.                                                 
. /* Triple combination ICS */ 
. * Any prescription for a LABA LAMA ICS combination 
. replace exposure = 2 if laba_lama_ics == 1
(33,040 real changes made)

. replace exposure = 2 if laba_ics == 1 & lama_single == 1 
(41,008 real changes made)

. replace exposure = 2 if laba_single == 1 & lama_single == 1 & ics_single == 1 
(143 real changes made)

. replace exposure = 2 if laba_lama == 1 & ics_single == 1 
(1,171 real changes made)

. 
. * Define missing for tables 
. replace exposure = .u if exposure >= .
(0 real changes made)

.                                                 
. label define exposure 0 "LABA/LAMA Combination" 1 "ICS Dual Combination" 2 "ICS Triple Combination" .u "Other"

. label values exposure exposure 

. 
. label var exposure "COPD Treatment Exposure"

. 
. /* SAVE DATA==================================================================*/        
. 
. sort patient_id

. save $tempdir\analysis_dataset, replace
file copd_tempdata_sens1\analysis_dataset.dta saved

. 
. * Save a version set on outcome
. * Save a version set on survival outcome
. stset stime_$outcome, fail($outcome) id(patient_id) enter(enter_date) origin(enter_date)        

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    292,097  total observations
          0  exclusions
------------------------------------------------------------------------------
    292,097  observations remaining, representing
    292,097  subjects
        742  failures in single-failure-per-subject data
   19184453  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        66

. save $tempdir\analysis_dataset_STSET_$outcome, replace
file copd_tempdata_sens1\analysis_dataset_STSET_onscoviddeath.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\copd_log_sens1\S1-02_cr_create_copd_exposure.log
  log type:  text
 closed on:  24 Jul 2020, 10:25:38
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
