-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\asthma_log_sens3\02_cr_create_asthma_exposure.log
  log type:  text
 opened on:   9 Jun 2020, 12:12:33

. 
. /* TREATMENT EXPOSURE=========================================================*/        
. 
. /* SABA ONLY */ 
. 
. * At least one prescription of SABA single 
. gen exposure = 0 if saba_single == 1
(685,323 missing values generated)

. 
. * And not a LABA, ICS or LTRA single or in combination 
. recode exposure(0 = .u) if ics_single == 1 
(exposure: 223358 changes made)

. recode exposure(0 = .u) if laba_ics == 1 
(exposure: 284761 changes made)

. recode exposure(0 = .u) if laba_lama == 1
(exposure: 9 changes made)

. recode exposure(0 = .u) if laba_lama_ics == 1 
(exposure: 669 changes made)

. recode exposure(0 = .u) if ltra_single == 1 
(exposure: 2590 changes made)

. 
. /* ICS */
.                                 
. * Most recent low or high dose before index
. 
. replace exposure = 1 if low_med_dose_ics == 1 & ///
>                                                 low_med_dose_ics_date == max(low_med_dose_ics_date, high_dose_ics_date)
(628,754 real changes made)

. replace exposure = 2 if high_dose_ics == 1 & /// 
>                                                 high_dose_ics_date == max(low_med_dose_ics_date, high_dose_ics_date)    
(102,716 real changes made)

. 
. * If both on same date, code above assumes high dose            
. 
. replace exposure = .u if exposure >= .
(465,198 real changes made, 465,198 to missing)

.                                                 
. label define exposure 0 "SABA only" 1 "ICS (Low/Medium Dose)" 2 "ICS (High Dose)" .u "Other"

. label values exposure exposure 

. 
. label var exposure "Asthma Treatment Exposure"

. 
. /* SAVE DATA==================================================================*/        
. 
. sort patient_id

. save $tempdir\analysis_dataset, replace
file asthma_tempdata_sens3\analysis_dataset.dta saved

. 
. * Save a version set on outcome
. stset stime_$outcome, fail($outcome) id(patient_id) enter(enter_date) origin(enter_date)        

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
  1,330,667  total observations
          0  exclusions
------------------------------------------------------------------------------
  1,330,667  observations remaining, representing
  1,330,667  subjects
        703  failures in single-failure-per-subject data
   87747564  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        66

. save $tempdir\analysis_dataset_STSET_$outcome, replace
file asthma_tempdata_sens3\analysis_dataset_STSET_onscoviddeath.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\opensafely-ics-research\analysis\asthma_log_sens3\02_cr_create_asthma_exposure.log
  log type:  text
 closed on:   9 Jun 2020, 12:12:53
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
